OpenFOAM_Case/injectorNozzle/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          binary;
    class           volVectorField;
    object          U.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {   
        /*
        type            fixedValue;
        value           uniform (0 0 -0.1);
        */
        type            pressureInletOutletVelocity;
        value           $internalField;       
    }   
    outlet
    {
        type            pressureInletOutletVelocity;//inletOutlet;//pressureInletOutletVelocity;
        //inletValue      uniform (0 0 0);
        value           $internalField;
    }
    "injectorWall.*"
    {
        type            fixedValue;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
        value           $internalField;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
